In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data =np.random.rand(4,3)

In [4]:
data

array([[0.79237504, 0.46765863, 0.33809406],
       [0.91170892, 0.84023684, 0.33492852],
       [0.04896558, 0.78068923, 0.29809142],
       [0.89397354, 0.89398454, 0.2084557 ]])

In [5]:
 dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  0.792375  0.467659  0.338094
1  0.911709  0.840237  0.334929
2  0.048966  0.780689  0.298091
3  0.893974  0.893985  0.208456

In [7]:
yeniDataFrame = pd.DataFrame(data,index=["Baran","Öner","Arda","Çolak"],columns = ["Maas","Yas","Calısma Saati"])

In [8]:
yeniDataFrame

           Maas       Yas  Calısma Saati
Baran  0.792375  0.467659       0.338094
Öner   0.911709  0.840237       0.334929
Arda   0.048966  0.780689       0.298091
Çolak  0.893974  0.893985       0.208456

In [9]:
yeniDataFrame["Maas"]

Baran    0.792375
Öner     0.911709
Arda     0.048966
Çolak    0.893974
Name: Maas, dtype: float64

In [10]:
yeniDataFrame[["Maas","Yas"]]

           Maas       Yas
Baran  0.792375  0.467659
Öner   0.911709  0.840237
Arda   0.048966  0.780689
Çolak  0.893974  0.893985

In [11]:
yeniDataFrame.loc["Baran"]

Maas             0.792375
Yas              0.467659
Calısma Saati    0.338094
Name: Baran, dtype: float64

In [12]:
yeniDataFrame.iloc[1]

Maas             0.911709
Yas              0.840237
Calısma Saati    0.334929
Name: Öner, dtype: float64

In [13]:
yeniDataFrame["Emeklilik Yasi"]= yeniDataFrame["Yas"] + yeniDataFrame['Yas']

In [14]:
yeniDataFrame

           Maas       Yas  Calısma Saati  Emeklilik Yasi
Baran  0.792375  0.467659       0.338094        0.935317
Öner   0.911709  0.840237       0.334929        1.680474
Arda   0.048966  0.780689       0.298091        1.561378
Çolak  0.893974  0.893985       0.208456        1.787969

In [15]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1)

           Maas       Yas  Calısma Saati
Baran  0.792375  0.467659       0.338094
Öner   0.911709  0.840237       0.334929
Arda   0.048966  0.780689       0.298091
Çolak  0.893974  0.893985       0.208456

In [16]:
yeniDataFrame.drop("Öner",axis=0)

           Maas       Yas  Calısma Saati  Emeklilik Yasi
Baran  0.792375  0.467659       0.338094        0.935317
Arda   0.048966  0.780689       0.298091        1.561378
Çolak  0.893974  0.893985       0.208456        1.787969

In [17]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)

In [18]:
yeniDataFrame

           Maas       Yas  Calısma Saati
Baran  0.792375  0.467659       0.338094
Öner   0.911709  0.840237       0.334929
Arda   0.048966  0.780689       0.298091
Çolak  0.893974  0.893985       0.208456

In [19]:
yeniDataFrame.loc["Baran","Yas"]

0.4676586284022498

In [20]:
boolean =yeniDataFrame<0

In [21]:
yeniDataFrame[boolean]

       Maas  Yas  Calısma Saati
Baran   NaN  NaN            NaN
Öner    NaN  NaN            NaN
Arda    NaN  NaN            NaN
Çolak   NaN  NaN            NaN

In [22]:
yeniDataFrame[yeniDataFrame<0]

       Maas  Yas  Calısma Saati
Baran   NaN  NaN            NaN
Öner    NaN  NaN            NaN
Arda    NaN  NaN            NaN
Çolak   NaN  NaN            NaN

In [23]:
yeniDataFrame["Yas"]>0

Baran    True
Öner     True
Arda     True
Çolak    True
Name: Yas, dtype: bool

In [24]:
yeniDataFrame[yeniDataFrame["Yas"] > 0.4]

           Maas       Yas  Calısma Saati
Baran  0.792375  0.467659       0.338094
Öner   0.911709  0.840237       0.334929
Arda   0.048966  0.780689       0.298091
Çolak  0.893974  0.893985       0.208456

In [26]:
yeniDataFrame.reset_index()

   index      Maas       Yas  Calısma Saati
0  Baran  0.792375  0.467659       0.338094
1   Öner  0.911709  0.840237       0.334929
2   Arda  0.048966  0.780689       0.298091
3  Çolak  0.893974  0.893985       0.208456

In [28]:
yeniIndexListesi = ["Ati","Zey","Baran","Kasım"]

In [29]:
yeniDataFrame["Yeni Index"] = yeniIndexListesi

In [32]:
yeniDataFrame.set_index("Yeni Index",inplace=True)

In [33]:
yeniDataFrame

                Maas       Yas  Calısma Saati
Yeni Index
Ati         0.792375  0.467659       0.338094
Zey         0.911709  0.840237       0.334929
Baran       0.048966  0.780689       0.298091
Kasım       0.893974  0.893985       0.208456

In [35]:
yeniDataFrame.loc["Ati"]

Maas             0.792375
Yas              0.467659
Calısma Saati    0.338094
Name: Ati, dtype: float64